RIET/src/InformationRegisters/WaybillsAndCREWs/WaybillsAndCREWs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>WaybillsAndCREWs</name>
  <resources>
    <name>CREW</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Trip</name>
    <type>
      <types>DocumentRef.Trip</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Waybill</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/InformationRegisters/WaybillsAndCREWs/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ПолучитьДанныеПоТрипу(Трип) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	WaybillsAndCREWs.Waybill,
	|	WaybillsAndCREWs.CREW
	|ИЗ
	|	РегистрСведений.WaybillsAndCREWs КАК WaybillsAndCREWs
	|ГДЕ
	|	WaybillsAndCREWs.Trip = &Trip";
	Запрос.УстановитьПараметр("Trip", Трип);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
	
#КонецЕсли
